def numbers_to_words(num):
    one = [
        "",
        "один",
        "два",
        "три",
        "четыре",
        "пять",
        "шесть",
        "семь",
        "восемь",
        "девять",
    ]
    two = [
        "",
        "",
        "двадцать",
        "тридцать",
        "сорок",
        "пятьдесят",
        "шестьдесят",
        "семьдесят",
        "восемьдесят",
        "девяносто",
    ]
    ten = [
        "десять",
        "одиннадцать",
        "двенадцать",
        "тринадцать",
        "четырнадцать",
        "пятнадцать",
        "шестнадцать",
        "семнадцать",
        "восемнадцать",
        "девятнадцать",
    ]

    num = int(num)
    if 0 < num < 10:
        return one[num]
    elif 19 < num < 100:
        return two[int(str(num)[0])] + " " + one[int(str(num)[1])]
    elif 9 < num < 20:
        return ten[int(str(num)[1])]


print(numbers_to_words(99))
